# -*- coding: utf-8 -*-


mail = {
    'sender': 'xx@163.com',
    'host': 'smtp.163.com',
    'receivers': ['xx@qq.com', 'xx@qq.com'],
    'password': 'xx',
    'subject_prefix': '豆瓣爬虫租房'
}

groups = [
    ('szsh', '深圳租房'),
    (637628, '深圳租房'),
    (551176, '深圳租房'),
    (609271, '深圳租房'),
    ('SZhouse', '深圳租房'),
    (609271, '深圳租房'),
    ('nanshanzufang', '南山租房'),
    (106955, '深圳租房团'),
    (637638, '深圳南山租房'),
    (637700, '深圳宝安租房'),
    (498004, '深圳南山租房团'),
    (537027, '整租深圳租房'),
    ('bazf', '宝安租房'),
    ('nszf', '南山租房'),
    (605557, '深圳南山西丽'),
]

#locations = ('兴东', '西丽',)
locations = ('兴东', '西丽', '茶光', '珠光', '留仙洞', '西丽湖', '宝安中心', '宝中')

exclude_words = ('求租', '合租', '招租', '室友', '一房一厅', '一室一卫', 
                 '一室一厅', '单间', '1室1卫', '1房1厅', '1室1厅' '女生',
                 '男生', '次卧', '已租', '已转', '单房', '主卧')

time_require = 72  # latest xx hour 
